Autodesk.Revit.DB.Dimension.Above
The text shown above the segment's value.
Remarks: This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.Suffix
The text shown after the segment's value.
Remarks: This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.

Autodesk.Revit.DB.Dimension.Prefix
The text shown before the segment's value.
Remarks: This property is for use with single-segment dimensions only.
For multi-segment dimensions use the corresponding properties of the
DimensionSegment class.